ERP/src/InformationRegisters/ПланВыставленияСчетовНаПродлениеПодписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПланВыставленияСчетовНаПродлениеПодписки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оплачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПодписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОплатаПодписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодОбновления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодПодписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Подписка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/Enums/СтатусПодписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусПодписки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменяется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERP/src/Documents/ВнесениеОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВнесениеОплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БалансВыплатКонтрагентам</xr:Item>
				<xr:Item>AccumulationRegister.ВыручкаОборот</xr:Item>
				<xr:Item>AccumulationRegister.БалансСчетовПользователей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПодписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERP/src/Documents/ПерсональныйПромокод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПерсональныйПромокод</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПромокодыПериодДействия</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промокод</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПромокодСтрока</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реферал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатеринскийРеферал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПартнерскаяКомпания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПартнерскаяКомпания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВознаграждения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипВознагражденияЗаРеферал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERP/src/CommonModules/ОплатаПодпискиНаСервере/Ext/Module.bsl
Функция ПолучитьКрайнийСрокОплаты(ВремяНаОплату = Неопределено, ДатаНачала = Неопределено)
		
	Если ДатаНачала = Неопределено Тогда
		
		ДатаНачала = ТекущаяДата();	
		
	КонецЕсли;
	
	Возврат ДатаНачала + Константы.КрайнийСрокОплатыПодпискиВДнях.ВСекундах();
	
КонецФункции

Процедура ЗавершениеПервойОплаты(Счет) Экспорт
	
	НоваяОплатаПодписки = Документы.ВнесениеОплаты.СоздатьДокумент();
	НоваяОплатаПодписки.Дата = ТекущаяДата();
	НоваяОплатаПодписки.ДатаОплаты = ТекущаяДата();
	НоваяОплатаПодписки.Счет = Счет;
	НоваяОплатаПодписки.Контрагент = Счет.Контрагент;
	НоваяОплатаПодписки.СуммаДокумента = Счет.СуммаДокумента;
	НоваяОплатаПодписки.СпособОплаты = Счет.ОжидаемыйСпособОплаты;
	НоваяОплатаПодписки.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	
	Счет.Оплата = НоваяОплатаПодписки.Ссылка;
	Счет.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	
	Подписка = Счет.Подписка.ПолучитьОбъект();
	Подписка.Статус = Перечисления.СтатусПодписки.Активна;
	Подписка.ДатаНачала = ТекущаяДата();
	Подписка.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	
	РегистрыСведений.ПланВыставленияСчетовНаПродлениеПодписки.ЗапланироватьСледующуюОплату(Счет.Подписка);
	
	НовыйПерсональныйПромокод = Документы.ПерсональныйПромокод.СоздатьДокумент();
	НовыйПерсональныйПромокод.НачалоДействия = ТекущаяДата();
	НовыйПерсональныйПромокод.Промокод = ОбщегоНазначения.ГенерироватьСлучайнуюПоследовательностьБуквЦифр();
	НовыйПерсональныйПромокод.Реферал = Счет.Контрагент;
	НовыйПерсональныйПромокод.МатеринскийРеферал = Подписка.Реферал;
	//НовыйПерсональныйПромокод.ПартнерскаяКомпания = Значение;
	//НовыйПерсональныйПромокод.ПрайсЛист = Значение;
	//НовыйПерсональныйПромокод.ЗначениеВознаграждения = Значение;
	//НовыйПерсональныйПромокод.ТипВознаграждения = Значение;
	// TODO!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

КонецПроцедуры
